[
  {
    "bar_name": "Civil Liberties",
    "patio": true,
    "website": "https://civillibertiesbar.com/",
    "address": "https://goo.gl/maps/oCnESiLQfRpzzJC39",
    "province": "Ontario",
    "description": "The neon \"Cocktails & Dreams\" sign hanging in the front window is a great example of truth in advertising. And success has kept Canada's Best Bar — for the second year in a row — honest. One of the very few Canadian bars dedicated to custom cocktail service, Civil isn't fancy. Parts of the floor are painted plywood, its \"copper\" bar is made from pennies, and food comes from a Vietnamese restaurant down the street. The vibe ranges from alcohol-nerd symposium to full-on party bar, depending on the time of night. Since last year's awards (it also cracked the top 10 on North America's 50 Best Bars list), Civil has pushed its drinks program forward with new cocktails on tap, a shelf-stable margarita from its micro-distillation project and an ambitious pop-up program, which has already hosted Mexico City's Hanky Panky. And it will always \"choose kind over cool.\"",
    "ranks": [
      { "year": 2023, "rank_position": 1 },
      { "year": 2022, "rank_position": 1 },
      { "year": 2020, "rank_position": 8 }
    ]
  },
  {
    "bar_name": "The Cloakroom",
    "patio": false,
    "website": "http://cloakroombar.squarespace.com/",
    "address": "https://goo.gl/maps/etmaQwnqiM4c4k3D8",
    "province": "Québec",
    "description": "Hidden behind Maison Cloakroom, a made-to-measure menswear shop in a striking century-old building on Montreal's Golden Mile, is a chic 25-seat bar that trades in one thing and one thing only — delicious cocktails made with integrity. The Cloakroom Bar is known for its purist approach and unflinching commitment to sourcing only the highest-quality ingredients. If they can't find a decent strawberry liqueur, they make their own. As a result, the bespoke cocktails here are a cut — or two — above your average tailor-made drink experience, especially since the bartenders are known for their uncanny ability to size up a guest and figure out the perfect concoction.",
    "ranks": [
      { "year": 2023, "rank_position": 1 },
      { "year": 2022, "rank_position": 9 },
      { "year": 2020, "rank_position": 7 }
    ]
  },
  {
    "bar_name": "Atwater Cocktail Club",
    "patio": false,
    "website": "http://atwatercocktailclub.com/",
    "address": "https://goo.gl/maps/Yq44YpwnLn2GMk2N8",
    "province": "Québec",
    "description": "Although it’s become one of Montreal’s top destination bars, ACC got its start in 2016 as a neighbourhood bar — a vibe that is alive and well, thanks to a core group of locals who still hang there, especially on the early shift. No matter what time, though, it’s always a lively room, full of folks taking it easy on glittery couches, huddled around bistro tables or perched at the bar with its stunning collection of rare bottles from around the world. An extensive menu of signature cocktails inspired by modern classics includes the Thunder Gibson, an umami-rich martini riff with a touch of salinity. The inventive drinks beg to be paired with first-rate bar snacks, such as frogs' legs, escargots and chicken liver mousse.",
    "ranks": [
      { "year": 2023, "rank_position": 3 },
      { "year": 2022, "rank_position": 5 },
      { "year": 2020, "rank_position": 3 }
    ]
  },
  {
    "bar_name": "Botanist",
    "patio": false,
    "website": "http://botanistrestaurant.com/",
    "address": "https://goo.gl/maps/ehuNZ5Wqwb8kUuFt9",
    "province": "British Columbia",
    "description": "It’s only a little slip of a bar, tucked into a quiet corridor at the top of a grand staircase connecting the Fairmont Pacific Rim hotel’s raucous Lobby Lounge and elegant Botanist restaurant. But don’t let the bar’s calm, caught-in-the-middle facade deceive you. The team that won an Exceptional Cocktails Award from Michelin has now garnered Michter’s Art of Hospitality Award 2023. The adjacent glass-encased cocktail lab — avant-garde when the bar opened in 2017 — creates mad-scientist infusions and extractions of uncommon clarity and delicacy. The VIP Cocktail Experience, for which a six-course tasting menu is driven by the high-concept drinks (and served at a private table behind velvet curtains), is one-of-a-kind. And last spring, when an international guest series kicked off with New York’s Katana Kitten, Botanist Bar was at the forefront of a collaboration wave that has become a momentous trend.",
    "ranks": [
      { "year": 2023, "rank_position": 4 },
      { "year": 2022, "rank_position": 2 },
      { "year": 2020, "rank_position": 6 }
    ]
  },
  {
    "bar_name": "Bar Pompette",
    "patio": true,
    "website": "http://pompette.ca/",
    "address": "https://goo.gl/maps/ThGn31NQoa3hL3tz5",
    "province": "Ontario",
    "description": "Between the French café atmosphere and the uncluttered backbar, a first-time caller would be hard pressed to guess that this casually chic space is home to one of the most impressive cocktail programs in Toronto. With a battery of high-tech kitchen tools, four cocktail taps and an in-house ice program, the bar crystallizes complex flavours and farm-fresh ingredients (think Périgord truffles and Chioggia beets) into deceptively simple-looking drinks that deliver astounding flavour and texture. Enjoy traditional croques monsieurs from sister restaurant Pompette, a charming back patio and live jazz on Sunday nights. It’s all served up with warm hospitality and Gallic joie de vivre.",
    "ranks": [
      { "year": 2023, "rank_position": 5 },
      { "year": 2022, "rank_position": 11 },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "Bar Raval",
    "patio": true,
    "website": "http://thisisbarraval.com/",
    "address": "https://goo.gl/maps/RGycQix2MrVHvAJn9",
    "province": "Ontario",
    "description": "The doors weren’t open for long before it became apparent that Bar Raval would evolve into something more than a great place for tapas. With its decadent interior of sinuous mahogany swirls, delicious pintxos, impeccable wine selection and full-on embrace of daytime drinking, Raval was a winning formula that immediately drew a lively crowd for breakfast sandwiches, midday snacks, late-night tapas and all manner of drinks in between. And Raval still does, partly because it stays true to the original concept of an elevated Spanish snack bar, but also because the bar team keeps its cocktail game tight and relevant, as evidenced by the new focus on fermentation from bar manager Élise Hanson.",
    "ranks": [
      { "year": 2023, "rank_position": 6 },
      { "year": 2022, "rank_position": 8 },
      { "year": 2020, "rank_position": 1 }
    ]
  },
  {
    "bar_name": "Mother Cocktail Bar",
    "patio": true,
    "website": "http://motherdrinks.co/",
    "address": "https://goo.gl/maps/atPr3Y4VvGEBS8Yo6",
    "province": "Ontario",
    "description": "The only bar in Toronto where you can stumble into a live jazz set, find serious bartenders throwing cocktails and sample fresh tastes from the on-site fermentation room, Mother Cocktail Bar has always offered an entirely unique experience. Smart, dramatic, chiaroscuro-inspired décor and a minimalist modern backbar create a relaxed vibe in which to contemplate an ambitious cocktail menu that pushes boundaries with ingredients such as candy cap mushrooms, lime pickles and iodine. Although the high-concept, perfectly executed drinks steal the show, Mother also has a terrific kitchen that fires up some of the city’s best bar food, including the must-try garlic-and-Parmesan fries with truffle-and-dill aïoli.",
    "ranks": [
      { "year": 2023, "rank_position": 7 },
      { "year": 2022, "rank_position": 17 },
      { "year": 2020, "rank_position": 16 }
    ]
  },
  {
    "bar_name": "The Keefer Bar",
    "patio": true,
    "website": "http://thekeeferbar.com/",
    "address": "https://goo.gl/maps/DkNQNfz4SeinPbXp8",
    "province": "British Columbia",
    "description": "Cyberpunk only gets better with age and so does The Keefer Bar, a 13-year-old Vancouver institution that looks like it sprang from an early William Gibson sci-fi novel and was jacked into a futuristic metaverse. Dark and gritty, illuminated by clinical anatomical illustrations and hung on an ancient Chinese apothecary theme that leans heavily into bitter botanicals, The Keefer also exudes a vibrancy and warmth that make you feel like you’ve stumbled into the world’s friendliest underground booze can where everyone knows your name. Drinks bubble with smoke and are stirred down to perfection. The music is chill. Although it was sad to see the end of the award-winning Keefer Yard, the inside bar didn’t miss a beat and will always be the city’s coolest cocktail OG.",
    "ranks": [
      { "year": 2023, "rank_position": 8 },
      { "year": 2022, "rank_position": 3 },
      { "year": 2020, "rank_position": 2 }
    ]
  },
  {
    "bar_name": "Milky Way",
    "patio": false,
    "website": "http://milkywaycocktails.com/",
    "address": "https://goo.gl/maps/fPEGMaCAgCefNvBs8",
    "province": "Québec",
    "description": "The black-light glow party starts at the bottom of Milky Way’s stairwell, guiding you on your journey into a new galaxy. Upstairs is airy and spacious, with a massive skylight, bright neon pink and green décor, and abundant plant life, all dramatically illuminated. It’s an undeniably cool space that borders on the clubby side, especially when the late-night dance party kicks in, but with far better food than your average outer-space-themed bar. Save room for the super-cheesy raclette pizza. Creative cocktails are expertly designed, including the highly popular Island in the Sun. Wine options are brilliant, especially the bubbles. And the spirits selection is world-class, particularly when it comes to interesting expressions of agave and sugarcane spirits.",
    "ranks": [
      { "year": 2023, "rank_position": 9 },
      { "year": 2022, "rank_position": 6 },
      { "year": 2020, "rank_position": 13 }
    ]
  },
  {
    "bar_name": "Laowai & Blnd Tger",
    "patio": false,
    "website": "http://laowai.ca/",
    "address": "https://goo.gl/maps/5VzxtFtmmVTbiCcC9",
    "province": "British Columbia",
    "description": "To find Laowai bar, swing by the Blnd Tger dumpling shop in Chinatown. Ask for #7 and, if you’re dressed appropriately (ballcaps, sweatpants and flip-flops are verboten), a freezer door will open to a luxe art deco–inspired space shimmering in gold and malachite. Browse bar manager Alex Black’s gorgeously illustrated menu of 12 Asian-inflected cocktails and soak up fascinating stories about the intersex crime lord, the libidinous emperor and other colourful characters that inspired them. Sip some baijiu — Laowai has Canada’s largest selection of the Chinese grain spirit. And be swept away by the illicit extravagance of 1920s-era Shanghai.",
    "ranks": [
      { "year": 2023, "rank_position": 10 },
      { "year": 2022, "rank_position": 4 },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "Proof",
    "patio": true,
    "website": "http://proofyyc.com/",
    "address": "https://goo.gl/maps/rFyrQJP3uUUDGsFN6",
    "province": "Alberta",
    "description": "Its sky-high backbar signals that Proof is a serious cocktail bar, but the laid-back staff strip away any sense of snobbishness. The oft-updated, book-length drink menu is full of clever surprises and complex flavour combinations. Try Masa Moto and let it take you on a tortilla-infused-mezcal and Cocchi Americano adventure.",
    "ranks": [
      { "year": 2023, "rank_position": 11 },
      { "year": 2022, "rank_position": 12 },
      { "year": 2020, "rank_position": 5 }
    ]
  },
  {
    "bar_name": "Cry Baby Gallery",
    "patio": false,
    "website": "http://crybabygallery.ca/",
    "address": "https://goo.gl/maps/XYPGSXN7xAMFYHkXA",
    "province": "Ontario",
    "description": "Hidden behind a rough-hewn art gallery in Little Portugal, you’ll find Cry Baby Gallery, a dark, moody cocktail bar at once intimate and industrial, adorned with a single Tiffany lamp at the end of the wood bar. Drinks meticulously crafted with house-made infusions are showy enough to rival the street-style exhibits curated by Mony Zakhour. Nibble on a snack plate with olives (that’s all there is) while sipping the signature Spicy Marg.",
    "ranks": [
      { "year": 2023, "rank_position": 12 },
      { "year": 2022, "rank_position": 29 },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "Clive's Classic Lounge",
    "patio": false,
    "website": "http://clivesclassiclounge.com/",
    "address": "https://goo.gl/maps/hvBxUNFdZ2UTiEX56",
    "province": "British Columbia",
    "description": "The choices are epic at Clive’s Classic Lounge — named Whisky Hotel Bar of 2023 by Whisky Magazine — where legendary West Coast barkeep Shawn Soole began Victoria’s cocktail revolution and returned, in 2020, to elevate it. Start with one of the 250-plus whiskies. Or a wee one-third-sized snacktail. Or perhaps a luxe Tres Vieux Carré, made with Tesseron Lot No. 90 XO. No longer a hometown secret, this dark, subtly glam, armchair-cozy bar at Chateau Victoria is now a destination.",
    "ranks": [
      { "year": 2023, "rank_position": 13 },
      { "year": 2022, "rank_position": 20 },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "Bar Mordecai",
    "patio": true,
    "website": "http://barmordecai.com/",
    "address": "https://goo.gl/maps/862uKxqozaWrbdsY7",
    "province": "Ontario",
    "description": "Choose your own adventure at the Wes Anderson–styled Bar Mordecai, whether it’s belting out tunes in the Dolly Parton–themed karaoke room, tossing back canned spritzes with the cool kids hanging at the Green Room bar, or lounging on a velvet couch in the hotel lobby–like main space. Led by C50B bartender of the year Christina Veira, Mordecai offers tasty tapas, inspired cocktails and, unusual for the late-night neighbourhood, a hopping happy hour.",
    "ranks": [
      { "year": 2023, "rank_position": 14 },
      { "year": 2022, "rank_position": 19 },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "The Coldroom",
    "patio": false,
    "website": "http://thecoldroommtl.com/",
    "address": "https://goo.gl/maps/k6BTr7fPx3wt7jHYA",
    "province": "Québec",
    "description": "There’s no sign, just a small logo of a rubber duck above an unmarked, handle-less door. And, in classic speakeasy style, you’ll have to wait for the bouncer to let you in. But persistence and patience have their rewards. In this case, a cocktail inspired by the owners’ fave Montreal restaurants – perhaps a boozy Gibeau Orange Julep. Or, for the intrepid off-roader, something sur-mesure.",
    "ranks": [
      { "year": 2023, "rank_position": 15 },
      { "year": 2022, "rank_position": 14 },
      { "year": 2020, "rank_position": 11 }
    ]
  },
  {
    "bar_name": "Dear Friend Bar",
    "patio": true,
    "website": "http://dearfriendbar.com/",
    "address": "https://goo.gl/maps/6z46JDW7bmt85Gib8",
    "province": "Nova Scotia",
    "description": "If Dartmouth is the new Brooklyn, Dear Friend, while not quite a Clover Club, is one of the first proper cocktail bars in the hipster burg across Halifax Harbour. Opened during the pandemic, this downtown snug, with its bentwood bar stools and a European café vibe, has quickly become a destination for creative cocktails, inspired updates on the classics, excellent plant-forward small plates and an epic buck-a-shuck happy hour.",
    "ranks": [
      { "year": 2023, "rank_position": 16 },
      { "year": 2022, "rank_position": 10 },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "Barchef",
    "patio": false,
    "website": "http://barchef.com/",
    "address": "https://goo.gl/maps/X6jodySQmhXSRhQi7",
    "province": "Ontario",
    "description": "People often talk about the “art of the bar,” but BarChef is the only place in Canada where the drinks are veritable installations. Take the Essence of Fall, made with balsam fir and served in a smoking woodlands diorama. The spectacle isn’t limited to the drinks. Owner Frankie Solarik puts on a riveting show, both behind his own bars (he recently opened Prequel) and as a judge on the Netflix series Drink Masters.",
    "ranks": [
      { "year": 2023, "rank_position": 17 },
      { "year": 2022, "rank_position": 18 },
      { "year": 2020, "rank_position": 26 }
    ]
  },
  {
    "bar_name": "Gift Shop",
    "patio": false,
    "website": "http://barberandco.com/gift-shop",
    "address": "https://goo.gl/maps/QDmPoiQWMsTgEm2cA",
    "province": "Ontario",
    "description": "A notoriously cheeky barman known only as “H” runs the show at this intimate cocktail den, tucked behind a barbershop. You might want to read his house rules first: “Don’t be a dick… I am an asshole to everyone equally.” Or watch a preview @baddrinkstv. Those who brave his salty banter will be rewarded with exquisitely made classics and a singular experience.",
    "ranks": [
      { "year": 2023, "rank_position": 18 },
      { "year": 2022, "rank_position": 16 },
      { "year": 2020, "rank_position": 9 }
    ]
  },
  {
    "bar_name": "El Pequeño",
    "patio": true,
    "website": "http://elpequenobar.com/",
    "address": "https://goo.gl/maps/PoNSnMNPBLpPVDZR6",
    "province": "Québec",
    "description": "Reimagine an Old Montreal souvenir shop as a grand Havana hotel lobby replete with an ornate glass chandelier and white marble countertops, then stock it with dozens of Caribbean rums and you’ll have what the owners proudly call “Canada’s smallest bar.” True to its name, El Pequeño holds only nine people — ten if you count the chatty bartender who regales visitors with Hemingway anecdotes.",
    "ranks": [
      { "year": 2023, "rank_position": 19 },
      { "year": 2022, "rank_position": 7 },
      { "year": 2020, "rank_position": 4 }
    ]
  },
  {
    "bar_name": "Coffee Oysters Champagne",
    "patio": true,
    "website": "http://sipshucksip.com/",
    "address": "https://goo.gl/maps/R1Q8BuComhgjBk9t6",
    "province": "Ontario",
    "description": "The pearly pink oyster bar is merely a front for a lavishly embellished speakeasy with layers of secret chambers. Ask to see the Champagne Room and a hidden doorway transports you to a sultry 1920s Parisian hotel lobby bar replete with a period-costumed cigarette girl and a strolling a cappella quartet.",
    "ranks": [
      { "year": 2023, "rank_position": 20 },
      { "year": 2022, "rank_position": 27 },
      { "year": 2020, "rank_position": 28 }
    ]
  },
  {
    "bar_name": "XXX",
    "patio": false,
    "website": "http://littlesisterto.com/",
    "address": "https://goo.gl/maps/aCTUYyY7YGApavKT6",
    "province": "Ontario",
    "description": "Every cocktail is a mini event at XXX, a tiny subterranean speakeasy decked out in groovy ’70s modern Nederland design. Tucked underneath the Dutch-Indo Little Sister Portland, this impossibly cool, always busy 20-seat space offers show-stopping drinks made with outlier ingredients, such as baijiu and foie gras. There are also tributes to Toronto modern classics, such as the Harbord Room’s Lady Sniper, outstanding fried chicken bites and an awesome rum selection.",
    "ranks": [
      { "year": 2023, "rank_position": 21 },
      { "year": 2022, "rank_position": 46 },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "Godspeed Brewery",
    "patio": true,
    "website": "http://godspeedbrewery.com/",
    "address": "https://goo.gl/maps/nui7aRHZmvtz6pDj7",
    "province": "Ontario",
    "description": "Graceful Japanese minimalism meets boisterous Bavarian beer hall in a hospitable taproom owned by a brewmaster, Luc Lafontaine (of Dieu du Ciel! fame), who is obsessed with perfection. Enjoy some of the most rigorously authentic Czech lagers brewed anywhere in Canada, including Sklepník Plzeň, fermented in pitch-lined barrels. Eclectic ales are made with green tea and yuzu. Sake, highballs and Pearl Morissette wines round out the bar.",
    "ranks": [
      { "year": 2023, "rank_position": 22 },
      { "year": 2022, "rank_position": null },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "Library Bar",
    "patio": false,
    "website": "http://librarybartoronto.com/",
    "address": "https://goo.gl/maps/kNVQJYNTYtArNpkn7",
    "province": "Ontario",
    "description": "The Fairmont Royal York’s fabled cocktail den, tucked in a quiet corner of the hotel, where after-parties from the Imperial Room once spilled, has turned a new chapter with its snazzy art deco redo. This is the place to seal the deal with a Pillet crystal glass of Louis XIII. Or fall in lust over a bubbly Twist of Fate (from the “romance” cocktails inspired by contemporary Canadian authors).",
    "ranks": [
      { "year": 2023, "rank_position": 23 },
      { "year": 2022, "rank_position": null },
      { "year": 2020, "rank_position": null }
    ]
  },
  {
    "bar_name": "The Bar At Alo",
    "patio": false,
    "website": "http://alorestaurant.com/bar",
    "address": "https://goo.gl/maps/MgSuUhkYQocJ3df36",
    "province": "Ontario",
    "description": "Reminiscent of a swanky London hotel bar, The Bar at Alo is one of the most elegant places in Toronto to lose yourself in a perfectly executed cocktail. Although the drinks program will always be the main event, the sixcourse tasting menu is a draw for foodies. The wine list is unusually deep. Reservations are advised.",
    "ranks": [
      { "year": 2023, "rank_position": 24 },
      { "year": 2022, "rank_position": 13 },
      { "year": 2020, "rank_position": 15 }
    ]
  },
  {
    "bar_name": "Clementine",
    "patio": true,
    "website": "http://barclementine.ca/",
    "address": "https://goo.gl/maps/DwusK9pwW9UfCbW16",
    "province": "Alberta",
    "description": "All dark wood with art nouveau accents, Clementine echoes a bygone era, complete with a long list of classic cocktails titled Try Before You Die and bolstered by $10 prices on Tuesdays. Modern house cocktails breathe new life into such overlooked spirits as green Chartreuse, shaken with pandan liqueur in the Langkawi sour or, in the Ibarra, mixed with white chocolate mezcal, one of many intriguing infusions.",
    "ranks": [
      { "year": 2023, "rank_position": 25 },
      { "year": 2022, "rank_position": 15 },
      { "year": 2020, "rank_position": 22 }
    ]
  }
]
